InformationRegisters/СотрудникиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ПродажиПоДисконтнымКартам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиПоДисконтнымКартам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/НастройкиЧастичногоВыбытияПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЧастичногоВыбытияПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НоменклатураЧастичногоВыбытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаЧастичногоВыбытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОписаниеНоменклатурыИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОписаниеНоменклатурыИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕмкостьПотребительскойУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВПотребительскойУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантЧастичногоВыбытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаЧастичногоВыбытияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантИспользованияЕдиницыХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияЕдиницыХраненияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотребительскаяУпаковка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпаковкаЧастичногоВыбытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникОписанияНоменклатурыИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственныйОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыПартий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СобственныеЗапасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДавальческоеСырье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНаКомиссии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыУпаковок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыУпаковок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МаркированныйТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонотоварнаяУпаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МультитоварнаяУпаковка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыУчетаЧастичногоВыбытияИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыУчетаЧастичногоВыбытияИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекущаяНоменклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастроеннаяНоменклатура</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фотоаппараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Духи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Велосипеды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КреслаКоляски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АльтернативныйТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпакованнаяВода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Антисептики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БАДы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НикотиносодержащаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зерно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗерна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоковаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольноеПиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорепродуктыПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияСАТУРН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗерноВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗернаВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МясоПодконтрольноеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетеринарныеПрепараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИгрыИИгрушкиДляДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РадиоэлектроннаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТитановаяМеталлопродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РастительныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптоволокноИОптоволоконнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтопительныеПриборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бакалея</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукцияДо9Процентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефоныИНоутбуки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КабельнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоторныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольныеНапитки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПивоВПотребительскихУпаковках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническиеСредстваРеабилитации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность2025</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхВлажныеБезВЕТИС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПолитикУказанияСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыПолитикУказанияСерий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СправочноеУказаниеСерий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвторасчетОстатковСерий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеОстаткамиСерий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ШтрихкодированиеРМКУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Заполняет представление единицы измерения номенклатуры.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура, для которой необходимо получить представление единицы измерения.
//  ПредставлениеЕИ - Строка - представление единицы измерения номенклатуры.
//  ПредставлениеЕИЧастичногоВыбытия - Строка - представление единицы измерения емкости номенклатуры
//   при частичном выбытии.
//
Процедура ЗаполнитьПредставлениеЕдиницыИзмерения(ТекущаяСтрока, ПредставлениеЕИ, ПредставлениеЕИЧастичногоВыбытия) Экспорт
	
	Результат = НСтр("ru = ''");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕдиницыИзмерения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО Номенклатура.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ТекущаяСтрока.Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Наименование;
	КонецЕсли;
	
	ПредставлениеЕИЧастичногоВыбытия = Результат;
	Если ЗначениеЗаполнено(ТекущаяСтрока.Упаковка) Тогда
		ПредставлениеЕИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Упаковка, "Наименование");
	Иначе
		ПредставлениеЕИ = Результат;
	КонецЕсли;
	
КонецПроцедуры

// Поиск кассира по считанному коду.
//
// Параметры
//  Объект - ДанныеФормыСткруктура - форма, в которой переопредляются значения.
//  Штрихкод - Строка - код, по которому выполняется поиск.
//
Процедура ВыполнитьПоискКассира(Объект, Штрихкод) Экспорт
	
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Кассир
	|ПОМЕСТИТЬ ТаблицаСотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ЭтоГруппа
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.Недействителен
	|	И Сотрудники.ШтрихКод = &Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудники.Кассир КАК Кассир,
	|	ЕСТЬNULL(СотрудникиПользователя.Пользователь, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Пользователь
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
	|		ПО ТаблицаСотрудники.Кассир = СотрудникиПользователя.Сотрудник");
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.Кассир = Выборка.Кассир;
		Объект.ПользовательБД = Выборка.Пользователь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПользовательБД) Тогда
		Объект.ПользовательБД = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

// Заполняет структуру кассира если владельцем является пользователь или физическое лицо.
//
// Параметры:
//  ВладелецШтрихкода - СправочникСсылка - объект для проверки и заполнения структуры.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  НайденныйКассир - Структура - содержащая данные кассира
//
Процедура ЗаполнитьДанныеНайденногоКассира(ВладелецШтрихкода, Форма, НайденныйКассир) Экспорт
	
	Если ТипЗнч(ВладелецШтрихкода) = Тип("СправочникСсылка.Пользователи")
		ИЛИ ТипЗнч(ВладелецШтрихкода) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		СтруктураКассира = Новый Структура;
		СтруктураКассира.Вставить("Кассир");
		СтруктураКассира.Вставить("ПользовательБД");
		
		Если ТипЗнч(ВладелецШтрихкода) = Тип("СправочникСсылка.Пользователи") Тогда
			
			СтруктураКассира.Кассир = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецШтрихкода, "ФизическоеЛицо");
			СтруктураКассира.ПользовательБД = ВладелецШтрихкода;
			
		Иначе
			
			СтруктураКассира.Кассир = ВладелецШтрихкода;
			
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СотрудникиПользователя.Пользователь КАК Пользователь,
			|	СотрудникиПользователя.Пользователь.Недействителен КАК ПользовательНедействителен,
			|	ВЫБОР
			|		КОГДА СотрудникиПользователя.Пользователь = &ТекущийПользователь
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоТекущийПользователь
			|ИЗ
			|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
			|ГДЕ
			|	СотрудникиПользователя.Сотрудник = &Сотрудник
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПользовательНедействителен,
			|	ЭтоТекущийПользователь УБЫВ");
			
			Запрос.УстановитьПараметр("Сотрудник", ВладелецШтрихкода);
			Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				СтруктураКассира.ПользовательБД = Выборка.Пользователь;
			Иначе
				СтруктураКассира.ПользовательБД = Пользователи.ТекущийПользователь();
			КонецЕсли;
			
		КонецЕсли;
		
		НайденныйКассир = СтруктураКассира;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет структуру дисконтной карты если владельцем является карта лояльности.
//
// Параметры:
//  ВладелецШтрихкода - СправочникСсылка - объект для проверки и заполнения структуры.
//  НайденнаяКартаЛояльности - Структура - содержащая данные карты лояльности
//
Процедура ЗаполнитьДанныеНайденнойКартыЛояльности(ВладелецШтрихкода, НайденнаяКартаЛояльности) Экспорт
	
	Если ТипЗнч(ВладелецШтрихкода) = Тип("СправочникСсылка.ДисконтныеКарты")
		ИЛИ ТипЗнч(ВладелецШтрихкода) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		СтруктураДисконтнойКарты = Новый Структура;
		СтруктураДисконтнойКарты.Вставить("КартаЛояльности");
		СтруктураДисконтнойКарты.Вставить("Контрагент");
		СтруктураДисконтнойКарты.Вставить("КодКарты");
		СтруктураДисконтнойКарты.Вставить("АдресЭПВладельцаКарты");
		СтруктураДисконтнойКарты.Вставить("НомерТелефонаВладельцаКарты");
		СтруктураДисконтнойКарты.Вставить("ДатаРождения");
		СтруктураДисконтнойКарты.Вставить("ФИО");
		СтруктураДисконтнойКарты.Вставить("ЭтоКомпания", Ложь);
		СтруктураДисконтнойКарты.Вставить("СуммаПродаж");
		СтруктураДисконтнойКарты.Вставить("КартаНедействительна", Ложь);
		
		Если ТипЗнч(ВладелецШтрихкода) = Тип("СправочникСсылка.ДисконтныеКарты") Тогда
		
			ВледелецКарты = ВладелецШтрихкода.ВладелецКарты;
			ЗаполнитьЗначенияСвойств(СтруктураДисконтнойКарты, ВладелецШтрихкода);
			СтруктураДисконтнойКарты.КартаЛояльности = ВладелецШтрихкода;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДисконтныеКарты.КодКартыМагнитный КАК КодКарты,
			|	ДисконтныеКарты.Ссылка КАК Ссылка,
			|	ДисконтныеКарты.КартаНедействительна КАК КартаНедействительна
			|ПОМЕСТИТЬ ПоискКартыДисконтная
			|ИЗ
			|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
			|ГДЕ
			|	ДисконтныеКарты.Ссылка = &КартаЛояльности
			|	И НЕ ДисконтныеКарты.КодКартыМагнитный = """"
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ДисконтныеКарты.КодКартыШтрихкод,
			|	ДисконтныеКарты.Ссылка,
			|	ДисконтныеКарты.КартаНедействительна
			|ИЗ
			|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
			|ГДЕ
			|	ДисконтныеКарты.Ссылка = &КартаЛояльности
			|	И НЕ ДисконтныеКарты.КодКартыШтрихкод = """"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПоискКартыДисконтная.КодКарты КАК КодКарты,
			|	СУММА(ЕСТЬNULL(ПродажиПоДисконтнымКартамОбороты.СуммаОборот, 0)) КАК СуммаПродаж,
			|	ПоискКартыДисконтная.КартаНедействительна КАК КартаНедействительна
			|ИЗ
			|	ПоискКартыДисконтная КАК ПоискКартыДисконтная
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиПоДисконтнымКартам.Обороты КАК ПродажиПоДисконтнымКартамОбороты
			|		ПО ПоискКартыДисконтная.Ссылка = ПродажиПоДисконтнымКартамОбороты.ДисконтнаяКарта
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоискКартыДисконтная.КодКарты,
			|	ПоискКартыДисконтная.КартаНедействительна";
			
			Запрос.УстановитьПараметр("КартаЛояльности", ВладелецШтрихкода);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				СтруктураДисконтнойКарты.КодКарты = Выборка.КодКарты;
				СтруктураДисконтнойКарты.СуммаПродаж = Выборка.СуммаПродаж;
				СтруктураДисконтнойКарты.КартаНедействительна = Выборка.КартаНедействительна;
			КонецЕсли;
			
		Иначе
			ВледелецКарты = ВладелецШтрихкода;
		КонецЕсли;
		
		СтруктураДисконтнойКарты.Контрагент = ВледелецКарты;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Контрагенты.Наименование КАК ФИО,
		|	Контрагенты.ДатаРождения КАК ДатаРождения,
		|	КонтрагентыАдресаЭП.АдресЭП КАК АдресЭПВладельцаКарты,
		|	КонтрагентыТелефоны.НомерТелефона КАК НомерТелефонаВладельцаКарты,
		|	ВЫБОР
		|		КОГДА Контрагенты.ВидКонтрагента В (&ВидыКонтрагентовКомпании)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоКомпания
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыАдресаЭП
		|		ПО (КонтрагентыАдресаЭП.Ссылка = Контрагенты.Ссылка)
		|			И (КонтрагентыАдресаЭП.Тип = &ТипКИАдресЭП)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыТелефоны
		|		ПО (КонтрагентыТелефоны.Ссылка = Контрагенты.Ссылка)
		|			И (КонтрагентыТелефоны.Тип = &ТипКИТелефон)
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа
		|	И НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.Ссылка = &ВледелецКарты";
		
		ВидыКонтрагентовКомпании = Новый Массив;
		ВидыКонтрагентовКомпании.Добавить(Перечисления.ВидыКонтрагентов.ЮридическоеЛицо);
		ВидыКонтрагентовКомпании.Добавить(Перечисления.ВидыКонтрагентов.ГосударственныйОрган);
		
		Запрос.УстановитьПараметр("ТипКИТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
		Запрос.УстановитьПараметр("ТипКИАдресЭП", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		Запрос.УстановитьПараметр("ВледелецКарты", СтруктураДисконтнойКарты.Контрагент);
		Запрос.УстановитьПараметр("ВидыКонтрагентовКомпании", ВидыКонтрагентовКомпании);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДисконтнойКарты, Выборка);
		КонецЕсли;
		
		НайденнаяКартаЛояльности = СтруктураДисконтнойКарты;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет структуру дисконтной карты
//
// Параметры:
//  МагнитныйКод - Строка - код, по которому выполняется поиск;
//  НомерТелефона - Строка - (необязательный) номер телефона владельца карты
//  ДанныеКарты - Структура,Неопределено - Параметры дисконтной карты, или Неопределено если карта не найдена
//
Процедура ЗаполнитьДанныеКартыЛояльностиПоМагнитномуКоду(МагнитныйКод, НомерТелефона, ДанныеКарты) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет сведения о существующей для номенклатуры упаковки
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура, для запроса информации об упаковке
//  ДанныеУпаковки - Структура
//     *Коэффициент - Число - коэффициент кратности упаковки
//     *Упаковка - СправочникСсылка.Упаковки - найденная упаковка для номенклатуры
//
Процедура ЗаполнитьДанныеУпаковкиДляТовара(Номенклатура, ДанныеУпаковки) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Коэффициент", 1);
	Результат.Вставить("Упаковка",
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ЕдиницыИзмерения.ПустаяСсылка"));
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Упаковки.Ссылка КАК Упаковка,
		|	Упаковки.Коэффициент КАК Коэффициент
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК Упаковки
		|ГДЕ
		|	НЕ Упаковки.ПометкаУдаления
		|	И Упаковки.Владелец = &Номенклатура");
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		
		МаксимальныйКоэффициент = 0;
		УпаковкаМаксКоэффициент = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Коэффициент > МаксимальныйКоэффициент Тогда
				
				МаксимальныйКоэффициент = Выборка.Коэффициент;
				УпаковкаМаксКоэффициент = Выборка.Упаковка;
				ЗаполнитьЗначенияСвойств(Результат, Выборка);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеУпаковки = Результат;
	
КонецПроцедуры

// Заполняет структуру позиции номенклатуры если владельцем является номенклатура.
//
// Параметры:
//  СтрокаРезультата - Структура - параметры для проверки и заполнения.
//  Форма - ФормаКлиентскогоПриложения - форма рабочего места кассира.
//  ПараметрыДляОбработкиШтрихкода - Структура - данные для обработки штрихкода.
//  НайденнаяНоменклатура - Структура - содержащая данные номенклатуры
//     * Весовой - Булево
//     * Количество - Число
//     * КоличествоУпаковок - Число
//     * Маркируемый - Булево
//     * НеобходимостьВводаСерии - Булево
//     * Номенклатура - ОпределяемыйТип.НоменклатураРМК
//     * ОсобенностьУчета - ОпределяемыйТип.ОсобенностиУчетаНоменклатурыРМК
//     * ПредставлениеНоменклатураХарактеристика - Строка
//     * Серия - ОпределяемыйТип.СерияРМК
//     * СистемаНалогообложения - ОпределяемыйТип.ТипыСистемНалогообложенияККТРМК
//     * СтавкаНДС - ОпределяемыйТип.СтавкаНДСРМК
//     * ТипНоменклатуры - ОпределяемыйТип.ТипыНоменклатурыРМК
//     * Упаковка - ОпределяемыйТип.УпаковкаРМК
//     * Фасованный - Булево
//     * Характеристика - ОпределяемыйТип.ХарактеристикаРМК
//     * Цена - Число
//     * Штрихкод - Строка
//     * Организация - ОпределяемыйТип.ОрганизацияРМК
//     * Партия - ОпределяемыйТип.ПартияРМК
//     * ИспользоватьПартии - Булево
//     * ПроверятьЗаполнениеПартий - Булево
//     * ПроверятьЗаполнениеСерий - Булево
//     * УникальностьСерии - Булево
//     * ЭтоНабор - Булево
//
Процедура ЗаполнитьДанныеНайденнойНоменклатуры(СтрокаРезультата, Форма, ПараметрыДляОбработкиШтрихкода,
		НайденнаяНоменклатура) Экспорт
	
	ВладелецШтрихкода = СтрокаРезультата.Владелец;
	ШтрихкодУпаковки = Неопределено;
	
	Если ТипЗнч(ВладелецШтрихкода) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
		ВладелецШтрихкода = ВладелецШтрихкода.Номенклатура;
		ШтрихкодУпаковки = СтрокаРезультата.Владелец;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецШтрихкода) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		СтруктураВыбора = Новый Структура;
		ЗаполнитьСтруктуруВыбора(СтруктураВыбора);
		
		СтруктураВыбора.ПоштучноеВыбытие = Ложь;
		Если СтрокаРезультата.Свойство("РазрешительныйРежимИдентификаторЗапросаГИСМТ") Тогда
			ЗаполнитьЗначенияСвойств(СтруктураВыбора, СтрокаРезультата, 
				"РазрешительныйРежимИдентификаторЗапросаГИСМТ, РазрешительныйРежимДатаЗапросаГИСМТ");
		Конецесли;
		
		СтруктураВыбора.Штрихкод = СтрокаРезультата.ДанныеПО;
		СтруктураВыбора.Номенклатура = ВладелецШтрихкода;
		СтруктураВыбора.Характеристика = СтрокаРезультата.Характеристика;
		
		ЗаполнитьДанныеНоменклатуры(СтруктураВыбора, Форма.ИспользоватьВыборСкладаПриПродаже);
		Если СтруктураВыбора.Маркируемый И Не ТипЗнч(Форма) = Тип("Структура") Тогда
			ЗаполнитьПризнакиПоштучногоВыбытия(СтруктураВыбора.Номенклатура, СтруктураВыбора.Характеристика, СтруктураВыбора, Форма);
		КонецЕсли;
		
		Количество = СтрокаРезультата.Количество;
		Если НЕ СтрокаРезультата.Свойство("ВесИзШтрихкода") И ВладелецШтрихкода.Весовой Тогда
			Количество = 0;
		КонецЕсли;
		
		СтруктураВыбора.Количество = Количество;
		СтруктураВыбора.КоличествоУпаковок = Количество;
		
		СтруктураВыбора.Партия = СтрокаРезультата.Партия;
		Если НЕ ЗначениеЗаполнено(СтруктураВыбора.Партия)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураВыбора.Номенклатура, "ИспользоватьПартии") Тогда
			СтатусПартии = Новый СписокЗначений;
			СтатусПартии.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.СобственныеЗапасы"));
			СтатусПартии.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварыНаКомиссии"));
			
			ПартияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(
				СтруктураВыбора.Номенклатура,
				СтатусПартии);
			Если ЗначениеЗаполнено(ПартияПоУмолчанию) Тогда
				СтруктураВыбора.Партия = ПартияПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураВыбора.Партия)
			И СтруктураВыбора.Партия.Статус = Перечисления.СтатусыПартий.ТоварыНаКомиссии
			И Не ЗначениеЗаполнено(СтруктураВыбора.Партия.ВладелецПартии) Тогда
			СтруктураВыбора.Партия = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
		Если СтрокаРезультата.Свойство("СерияНоменклатуры") Тогда
			
			Если СтрокаРезультата.СерияНоменклатуры = Null Тогда
				СтрокаРезультата.СерияНоменклатуры = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СерииНоменклатуры.ПустаяСсылка");
			КонецЕсли;
			СтруктураВыбора.Серия = СтрокаРезультата.СерияНоменклатуры;
			СтруктураВыбора.СерияПредставление = Строка(СтрокаРезультата.СерияНоменклатуры);
			
		КонецЕсли;
		
		Если СтрокаРезультата.Свойство("Упаковка") Тогда
			СтруктураВыбора.Упаковка = СтрокаРезультата.Упаковка;
		КонецЕсли;
		
		Если Не ШтрихкодУпаковки = Неопределено Тогда
			ПроверитьЗаполненностьСерии(СтруктураВыбора, ШтрихкодУпаковки);
			
			ЗначенияШтрихкодаУпаковок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШтрихкодУпаковки, "ТипУпаковки, Количество");
			Если Не СтруктураВыбора.ПоштучноеВыбытие
				И Не ЗначениеЗаполнено(СтруктураВыбора.Упаковка)
				И ЗначенияШтрихкодаУпаковок.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка
				И ЗначенияШтрихкодаУпаковок.Количество > 1 Тогда
				
				УпаковкаНоменклатуры = Справочники.ЕдиницыИзмерения.ЕдиницаИзмеренияНоменклатуры(
					СтруктураВыбора.Номенклатура, ШтрихкодУпаковки.Количество);
				
				Если ЗначениеЗаполнено(УпаковкаНоменклатуры) Тогда
					СтруктураВыбора.Упаковка = УпаковкаНоменклатуры;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураВыбора.Упаковка) Тогда
			СтруктураВыбора.Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецШтрихкода, "ЕдиницаИзмерения");
		КонецЕсли;
		
		СтруктураВыбора.Фасованный = Ложь;
		
		СтруктураВыбора.ОплатаНедоступна = Ложь;
		ОбщегоНазначенияРМКУНФ.ЗаполнитьОрганизациюПродажи(СтруктураВыбора, Форма);
		Если Не ЗначениеЗаполнено(СтруктураВыбора.Организация) Тогда
			СтруктураВыбора.Организация = Форма.ОсновнаяОрганизация;
		Иначе
			
			Если ТипЗнч(Форма) = Тип("Структура") Тогда
				МассивОрганизаций = Форма.МассивОрганизаций;
				СтруктураВыбора.ОплатаНедоступна = МассивОрганизаций.Найти(СтруктураВыбора.Организация) = Неопределено;
			Иначе
				ОтборПоОрганизации = Новый Структура("Организация", СтруктураВыбора.Организация);
				КассыККМПоОрганизации = Форма.ТаблицаКассККМОрганизаций.НайтиСтроки(ОтборПоОрганизации);
				Если КассыККМПоОрганизации.Количество() = 0 Тогда
					СтруктураВыбора.ОплатаНедоступна = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтруктураВыбора.СистемаНалогообложения) Тогда
			ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьСНОККТДляОрганизации(СтруктураВыбора.СистемаНалогообложения, Форма);
		КонецЕсли;
		
		СтавкаНДС = ПродажиРМК.АктуальнаяСтавкаНДСДляТовара(Форма.Объект, СтруктураВыбора, СтруктураВыбора.СистемаНалогообложения);
		СтруктураВыбора.СтавкаНДС = СтавкаНДС;
		
		КодТРУ = ВладелецШтрихкода.КодТРУ;
		СтруктураВыбора.КодТРУ = КодТРУ;
		СтруктураВыбора.ВозможнаОплатаЭС = ЗначениеЗаполнено(КодТРУ);
		
		Характеристика = СтрокаРезультата.Характеристика;
		
		ПредставлениеХарактеристики = "";
		Если ЗначениеЗаполнено(СтруктураВыбора.Характеристика) Тогда
			ПредставлениеХарактеристики = " (" + СтруктураВыбора.Характеристика.Наименование + ")";
		КонецЕсли;
		
		ПредставлениеТовара = СтруктураВыбора.Наименование + ПредставлениеХарактеристики;
		СтруктураВыбора.ПредставлениеНоменклатураХарактеристика = ПредставлениеТовара;
		
		Если ТипЗнч(СтруктураВыбора.Упаковка) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			Коэффициент = СтруктураВыбора.Упаковка.Коэффициент;
		Иначе
			Коэффициент = 1;
		КонецЕсли;
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ДатаОбработки", ТекущаяДатаСеанса());
		СтруктураДанных.Вставить("Номенклатура", СтруктураВыбора.Номенклатура);
		СтруктураДанных.Вставить("Характеристика", СтруктураВыбора.Характеристика);
		СтруктураДанных.Вставить("Коэффициент", Коэффициент);
		СтруктураДанных.Вставить("ВалютаДокумента", Форма.РозничныйВидЦены.ВалютаЦены);
		СтруктураДанных.Вставить("ВидЦен", Форма.РозничныйВидЦены);
		СтруктураДанных.Вставить("СуммаВключаетНДС", Истина);
		СтруктураДанных.Вставить("СтавкаНДС", СтавкаНДС);
		СтруктураДанных.Вставить("ЕдиницаИзмерения", СтруктураВыбора.Упаковка);
		
		Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанных);
		СтруктураВыбора.Цена = Цена;
		
		ОбщегоНазначенияРМКПереопределяемый.СкорректироватьЦенуПодарочногоСертификата(Форма, СтруктураВыбора);
		
		НайденнаяНоменклатура = СтруктураВыбора;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет серию номенклатуры если ею является.
//
// Параметры:
//  ВладелецШтрихкода - СправочникСсылка - объект для проверки и заполнения структуры.
//  НайденнаяСерияНоменклатуры - ОпределяемыйТип.СерияНоменклатурыШтрихкода
//
Процедура ЗаполнитьДанныеНайденнойСерииНоменклатуры(ВладелецШтрихкода, НайденнаяСерияНоменклатуры) Экспорт
	
	Если ТипЗнч(ВладелецШтрихкода) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
		НайденнаяСерияНоменклатуры = ВладелецШтрихкода;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет партию номенклатуры если ею является.
//
// Параметры:
//  ВладелецШтрихкода - СправочникСсылка - объект для проверки и заполнения структуры.
//  НайденнаяПартияНоменклатуры - ОпределяемыйТип.ПартияНоменклатурыШтрихкода
//
Процедура ЗаполнитьДанныеНайденнойПартииНоменклатуры(ВладелецШтрихкода, НайденнаяПартияНоменклатуры) Экспорт
		
	Если ТипЗнч(ВладелецШтрихкода) = Тип("СправочникСсылка.ПартииНоменклатуры") Тогда
		НайденнаяПартияНоменклатуры = ВладелецШтрихкода;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет признак того, нужно ли проверять статус акцизной марки.
//
// НужнаПроверкаСтатусаМарки - Булево - Истина, если нужна проверка статуса марки.
//
Процедура ЗаполнитьПризнакНеобходимостиПроверкиСтатусаМарки(НужнаПроверкаСтатусаМарки) Экспорт
	
	НужнаПроверкаСтатусаМарки = Истина;
	
КонецПроцедуры

// Проверка статуса марки.
//
// Параметры
//  ПараметрыПроверки - Структура - параметры для проверки марки.
//
Процедура ПроверитьСтатусМарки(ПараметрыПроверки) Экспорт
	
	ТекстОшибки = "";
	
	Объект = ПараметрыПроверки.Объект;
	СтрокаТовары = ПараметрыПроверки.СтрокаТовары;
	Организация = СтрокаТовары.Организация;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТовары, "ПоштучноеВыбытие")
		И СтрокаТовары.ПоштучноеВыбытие Тогда
		Возврат;
	КонецЕсли;
	
	Операция = "Возврат";
	Если ОбщегоНазначенияРМК.ЭтоВидОперацииПродажа(Объект.ВидОперации) Тогда
		Операция = "Продажа";
	КонецЕсли;
	
	МассивШтрихкодов = Новый массив;
	МассивШтрихкодов.Добавить(ПараметрыПроверки.Штрихкод);
	
	ТипыУпаковок = Новый Массив;
	ТипыУпаковок.Добавить(Перечисления.ТипыУпаковок.МаркированныйТовар);
	
	ШтрихкодыУпаковок = ШтрихкодированиеИС.ШтрихкодыУпаковок(МассивШтрихкодов, ТипыУпаковок);
	
	ШтрихкодУпаковки = Неопределено;
	Если ШтрихкодыУпаковок.Количество() = 0 Тогда
		Возврат;
	Иначе
		ШтрихкодУпаковки = ШтрихкодыУпаковок[0].Ссылка;
	КонецЕсли;
	
	ОстаткиМаркируемойПродукции = ИнициализацияТаблицыПроверкиОстатков();
	ОстаткиПоУмолчанию = Новый Структура("Продажа, Возврат", 1, -1);
	
	СтрокаОстатки = ОстаткиМаркируемойПродукции.Добавить();
	СтрокаОстатки.ШтрихкодУпаковки = ШтрихкодУпаковки;
	СтрокаОстатки.Доступно = ОстаткиПоУмолчанию[Операция];
	
	ПараметрыСканирования = Новый Структура("Организация", Организация);
	
	ШтрихкодированиеИСПереопределяемый.ПриОпределенииОстатковМаркируемойПродукции(
		ОстаткиМаркируемойПродукции, ПараметрыСканирования);
	
	НайденнаяСтрока = ОстаткиМаркируемойПродукции.Найти(ШтрихкодУпаковки, "ШтрихкодУпаковки");
	
	УсловиеВыполнено = НайденнаяСтрока.Доступно >= 1;
	Если Операция = "Возврат" Тогда
		УсловиеВыполнено = Не УсловиеВыполнено;
	КонецЕсли;
	
	Если Не УсловиеВыполнено Тогда
		
		Если Операция = "Продажа" Тогда
			ТекстОшибки = НСтр("ru='Продана ранее по данным информационной базы'");
		Иначе
			ТекстОшибки = НСтр("ru='Уже в наличии по данным информационной базы'");
		КонецЕсли;
		
		ПараметрыПроверки.Вставить("ОшибкаЕГАИС", ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет наличие владельца в массиве и дополняет данные
//
// Параметры:
//  МассивКонтрагентов - Массив - Массив владельцев дисконтных карт.
//  ВладелецКарты - ОпределяемыйТип.КонтрагентРМК - Владелец дисконтной карты.
Процедура ДополнитьМассивВладельцамиКарт(МассивКонтрагентов, ВладелецКарты) Экспорт
	
	Если МассивКонтрагентов.Найти(ВладелецКарты) = Неопределено Тогда
		МассивКонтрагентов.Добавить(ВладелецКарты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Инициализирует таблицу значений для контроля остатков маркируемой продукции.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Описание:
//   * ШтрихкодУпаковки - СправочникСсылка.ШтрихкодыУпаковокТоваров - Код маркировки.
//   * Доступно - Число - Остаток маркируемой продукции.
//
Функция ИнициализацияТаблицыПроверкиОстатков()
	
	КвалификаторыЧисла  = Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Любой);
	
	ОстаткиМаркируемойПродукции = Новый ТаблицаЗначений;
	ОстаткиМаркируемойПродукции.Колонки.Добавить("ШтрихкодУпаковки",
		Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	ОстаткиМаркируемойПродукции.Колонки.Добавить("Доступно",
		Новый ОписаниеТипов("Число", КвалификаторыЧисла));
	
	Возврат ОстаткиМаркируемойПродукции;
	
КонецФункции

Процедура ЗаполнитьСтруктуруВыбора(СтруктураВыбора)
	
	СтруктураВыбора.Вставить("Весовой");
	СтруктураВыбора.Вставить("Количество");
	СтруктураВыбора.Вставить("КоличествоУпаковок");
	СтруктураВыбора.Вставить("Маркируемый");
	СтруктураВыбора.Вставить("НеобходимостьВводаСерии");
	СтруктураВыбора.Вставить("Номенклатура");
	СтруктураВыбора.Вставить("ОсобенностьУчета");
	СтруктураВыбора.Вставить("ПредставлениеНоменклатураХарактеристика");
	СтруктураВыбора.Вставить("Серия");
	СтруктураВыбора.Вставить("СерияПредставление");
	СтруктураВыбора.Вставить("СистемаНалогообложения");
	СтруктураВыбора.Вставить("СтавкаНДС");
	СтруктураВыбора.Вставить("ТипНоменклатуры");
	СтруктураВыбора.Вставить("Упаковка");
	СтруктураВыбора.Вставить("Фасованный");
	СтруктураВыбора.Вставить("Характеристика");
	СтруктураВыбора.Вставить("Цена");
	СтруктураВыбора.Вставить("Штрихкод");
	СтруктураВыбора.Вставить("Организация");
	СтруктураВыбора.Вставить("Партия");
	СтруктураВыбора.Вставить("ИспользоватьПартии");
	СтруктураВыбора.Вставить("ПроверятьЗаполнениеПартий");
	СтруктураВыбора.Вставить("ПроверятьЗаполнениеСерий");
	СтруктураВыбора.Вставить("УникальностьСерии");
	СтруктураВыбора.Вставить("ЭтоНабор");
	СтруктураВыбора.Вставить("ПоштучноеВыбытие");
	СтруктураВыбора.Вставить("ЧастичноеВыбытиеНоменклатура");
	СтруктураВыбора.Вставить("ЧастичноеВыбытиеХарактеристика");
	СтруктураВыбора.Вставить("ЧастичноеВыбытиеВариантУчета");
	СтруктураВыбора.Вставить("ЧастичноеВыбытиеКоличество");
	СтруктураВыбора.Вставить("КоличествоВПотребительскойУпаковке");
	СтруктураВыбора.Вставить("Наименование");
	СтруктураВыбора.Вставить("ТорговыйОбъект");
	СтруктураВыбора.Вставить("Ячейка");
	СтруктураВыбора.Вставить("КодТРУ");
	СтруктураВыбора.Вставить("ВозможнаОплатаЭС");
	СтруктураВыбора.Вставить("ОплатаНедоступна");
	СтруктураВыбора.Вставить("ЗапретитьВводДробногоКоличества");
	СтруктураВыбора.Вставить("РазрешительныйРежимИдентификаторЗапросаГИСМТ");
	СтруктураВыбора.Вставить("РазрешительныйРежимДатаЗапросаГИСМТ");
	СтруктураВыбора.Вставить("УчетНДССпецРежим", Ложь);
	СтруктураВыбора.Вставить("ПроизвольныйПодарочныйСертификат");
	СтруктураВыбора.Вставить("ПроверятьЗаполнениеХарактеристики");
	СтруктураВыбора.Вставить("СтавкаНДСУСН");
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиПоштучногоВыбытия(Номенклатура, Характеристика, СтруктураВыбора, Форма)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура КАК Номенклатура,
	|	НастройкиЧастичногоВыбытияПродукцииИС.Характеристика КАК Характеристика,
	|	НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия КАК НоменклатураЧастичногоВыбытия,
	|	НастройкиЧастичногоВыбытияПродукцииИС.ХарактеристикаЧастичногоВыбытия КАК ХарактеристикаЧастичногоВыбытия
	|ПОМЕСТИТЬ ТаблицаЧастичногоВыбытияПодменыНоменклатуры
	|ИЗ
	|	РегистрСведений.НастройкиЧастичногоВыбытияПродукцииИС КАК НастройкиЧастичногоВыбытияПродукцииИС
	|ГДЕ
	|	НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура = &Номенклатура
	|	И НастройкиЧастичногоВыбытияПродукцииИС.Характеристика = &Характеристика
	|	И НЕ НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура ЕСТЬ NULL
	|	И &УсловиеТолькоВРозлив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК ПоштучноеВыбытие,
	|	ТаблицаЧастичногоВыбытияПодменыНоменклатуры.НоменклатураЧастичногоВыбытия КАК ЧастичноеВыбытиеНоменклатура,
	|	ТаблицаЧастичногоВыбытияПодменыНоменклатуры.ХарактеристикаЧастичногоВыбытия КАК ЧастичноеВыбытиеХарактеристика,
	|	ЕСТЬNULL(ОписаниеНоменклатурыИС.ВариантЧастичногоВыбытия, ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаЧастичногоВыбытияИС.ПустаяСсылка)) КАК ЧастичноеВыбытиеВариантУчета,
	|	ЕСТЬNULL(ОписаниеНоменклатурыИС.ЕмкостьПотребительскойУпаковки, 0) КАК КоличествоВПотребительскойУпаковке,
	|	1 КАК ЧастичноеВыбытиеКоличество,
	|	ТаблицаЧастичногоВыбытияПодменыНоменклатуры.НоменклатураЧастичногоВыбытия КАК Номенклатура,
	|	ТаблицаЧастичногоВыбытияПодменыНоменклатуры.ХарактеристикаЧастичногоВыбытия КАК Характеристика
	|ПОМЕСТИТЬ ТаблицаДанныеПодменыНоменклатуры
	|ИЗ
	|	ТаблицаЧастичногоВыбытияПодменыНоменклатуры КАК ТаблицаЧастичногоВыбытияПодменыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|		ПО ТаблицаЧастичногоВыбытияПодменыНоменклатуры.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|ГДЕ
	|	НЕ ОписаниеНоменклатурыИС.Номенклатура ЕСТЬ NULL
	|	И ОписаниеНоменклатурыИС.ВариантЧастичногоВыбытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаЧастичногоВыбытияИС.НастроеннаяНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиЧастичногоВыбытияПродукцииИС.Номенклатура КАК Номенклатура,
	|	НастройкиЧастичногоВыбытияПродукцииИС.Характеристика КАК Характеристика,
	|	НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия КАК НоменклатураЧастичногоВыбытия,
	|	НастройкиЧастичногоВыбытияПродукцииИС.ХарактеристикаЧастичногоВыбытия КАК ХарактеристикаЧастичногоВыбытия
	|ПОМЕСТИТЬ ТаблицаЧастичногоВыбытия
	|ИЗ
	|	РегистрСведений.НастройкиЧастичногоВыбытияПродукцииИС КАК НастройкиЧастичногоВыбытияПродукцииИС
	|ГДЕ
	|	НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия = &Номенклатура
	|	И НастройкиЧастичногоВыбытияПродукцииИС.ХарактеристикаЧастичногоВыбытия = &Характеристика
	|	И НЕ НастройкиЧастичногоВыбытияПродукцииИС.НоменклатураЧастичногоВыбытия ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК ПоштучноеВыбытие,
	|	ТаблицаЧастичногоВыбытия.НоменклатураЧастичногоВыбытия КАК ЧастичноеВыбытиеНоменклатура,
	|	ТаблицаЧастичногоВыбытия.ХарактеристикаЧастичногоВыбытия КАК ЧастичноеВыбытиеХарактеристика,
	|	ЕСТЬNULL(ОписаниеНоменклатурыИС.ВариантЧастичногоВыбытия, ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаЧастичногоВыбытияИС.ПустаяСсылка)) КАК ЧастичноеВыбытиеВариантУчета,
	|	ЕСТЬNULL(ОписаниеНоменклатурыИС.ЕмкостьПотребительскойУпаковки, 0) КАК КоличествоВПотребительскойУпаковке,
	|	1 КАК ЧастичноеВыбытиеКоличество,
	|	ТаблицаЧастичногоВыбытия.НоменклатураЧастичногоВыбытия КАК Номенклатура,
	|	ТаблицаЧастичногоВыбытия.ХарактеристикаЧастичногоВыбытия КАК Характеристика
	|ПОМЕСТИТЬ ТаблицаДанныеПоштучногоВыбытия
	|ИЗ
	|	ТаблицаЧастичногоВыбытия КАК ТаблицаЧастичногоВыбытия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|		ПО ТаблицаЧастичногоВыбытия.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
	|ГДЕ
	|	НЕ ОписаниеНоменклатурыИС.Номенклатура ЕСТЬ NULL
	|	И ОписаниеНоменклатурыИС.ВариантЧастичногоВыбытия = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаЧастичногоВыбытияИС.НастроеннаяНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныеПодменыНоменклатуры.ПоштучноеВыбытие КАК ПоштучноеВыбытие,
	|	ТаблицаДанныеПодменыНоменклатуры.ЧастичноеВыбытиеНоменклатура КАК ЧастичноеВыбытиеНоменклатура,
	|	ТаблицаДанныеПодменыНоменклатуры.ЧастичноеВыбытиеХарактеристика КАК ЧастичноеВыбытиеХарактеристика,
	|	ТаблицаДанныеПодменыНоменклатуры.ЧастичноеВыбытиеВариантУчета КАК ЧастичноеВыбытиеВариантУчета,
	|	ТаблицаДанныеПодменыНоменклатуры.КоличествоВПотребительскойУпаковке КАК КоличествоВПотребительскойУпаковке,
	|	ТаблицаДанныеПодменыНоменклатуры.ЧастичноеВыбытиеКоличество КАК ЧастичноеВыбытиеКоличество,
	|	ТаблицаДанныеПодменыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаДанныеПодменыНоменклатуры.Характеристика КАК Характеристика
	|ИЗ
	|	ТаблицаДанныеПодменыНоменклатуры КАК ТаблицаДанныеПодменыНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныеПоштучногоВыбытия.ПоштучноеВыбытие,
	|	ТаблицаДанныеПоштучногоВыбытия.ЧастичноеВыбытиеНоменклатура,
	|	ТаблицаДанныеПоштучногоВыбытия.ЧастичноеВыбытиеХарактеристика,
	|	ТаблицаДанныеПоштучногоВыбытия.ЧастичноеВыбытиеВариантУчета,
	|	ТаблицаДанныеПоштучногоВыбытия.КоличествоВПотребительскойУпаковке,
	|	ТаблицаДанныеПоштучногоВыбытия.ЧастичноеВыбытиеКоличество,
	|	ТаблицаДанныеПоштучногоВыбытия.Номенклатура,
	|	ТаблицаДанныеПоштучногоВыбытия.Характеристика
	|ИЗ
	|	ТаблицаДанныеПоштучногоВыбытия КАК ТаблицаДанныеПоштучногоВыбытия";
	
	ВидыПродукцииИСТолькоВРозлив = Новый Массив;
	ВидыПродукцииИСТолькоВРозлив.Добавить(Перечисления.ВидыПродукцииИС.Алкогольная);
	УсловиеТолькоВРозлив = (ВидыПродукцииИСТолькоВРозлив.Найти(СтруктураВыбора.ОсобенностьУчета) = Неопределено);
	
	Запрос.УстановитьПараметр("УсловиеТолькоВРозлив", УсловиеТолькоВРозлив);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВыбора, Выборка);
		ЗаполнитьДанныеНоменклатуры(СтруктураВыбора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеНоменклатуры(СтруктураВыбора, ИспользоватьВыборСклада = Ложь)
	
	Дата = ТекущаяДатаСеанса();
	ВидыПродукцииМаркируемые = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВидыАлкогольнойПродукции.Маркируемый, ЛОЖЬ)
	|		ИЛИ СпрНоменклатура.ВидПродукцииИС В (ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха), &ВидыПродукцииОбязательнойМаркировки) КАК Маркируемый,
	|	СпрНоменклатура.Весовой КАК Весовой,
	|	СпрНоменклатура.ЭтоНабор
	|		ИЛИ СпрНоменклатура.ЭтоАгентскаяУслуга КАК ЭтоНабор,
	|	СпрНоменклатура.ИспользоватьСерииНоменклатуры КАК НеобходимостьВводаСерии,
	|	СпрНоменклатура.ИспользоватьПартии КАК ИспользоватьПартии,
	|	СпрНоменклатура.ПроверятьЗаполнениеПартий КАК ПроверятьЗаполнениеПартий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СпрПолитикаУчетаСерий.ТипПолитики, ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроверятьЗаполнениеСерий,
	|	СпрНоменклатура.ИспользоватьУникальныеСерии КАК УникальностьСерии,
	|	СпрНоменклатура.ВидПродукцииИС КАК ОсобенностьУчета,
	|	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	СпрНоменклатура.Наименование КАК Наименование,
	|	СпрНоменклатура.Склад КАК ТорговыйОбъект,
	|	СпрНоменклатура.Ячейка КАК Ячейка,
	|	СпрНоменклатура.ЗапретитьВводДробногоКоличества КАК ЗапретитьВводДробногоКоличества,
	|	СпрНоменклатура.ПроизвольныйНоминал КАК ПроизвольныйПодарочныйСертификат,
	|	СпрНоменклатура.ПроверятьЗаполнениеХарактеристики КАК ПроверятьЗаполнениеХарактеристики
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыАлкогольнойПродукции КАК ВидыАлкогольнойПродукции
	|		ПО СпрНоменклатура.ВидАлкогольнойПродукции = ВидыАлкогольнойПродукции.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПолитикаУчетаСерий КАК СпрПолитикаУчетаСерий
	|		ПО СпрНоменклатура.ПолитикаУчетаСерий = СпрПолитикаУчетаСерий.Ссылка
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура");
	
	Запрос.УстановитьПараметр("Номенклатура", СтруктураВыбора.Номенклатура);
	Запрос.УстановитьПараметр("ВидыПродукцииОбязательнойМаркировки", ВидыПродукцииМаркируемые);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ИсключаяСвойства = "";
		ИсключаяСвойства = ?(Не ИспользоватьВыборСклада, "ТорговыйОбъект, Ячейка", ИсключаяСвойства);
		ЗаполнитьЗначенияСвойств(СтруктураВыбора, Выборка,, ИсключаяСвойства);
		ОбщегоНазначенияРМКУНФ.ПроверитьСкладДляРучногоВыбора(СтруктураВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполненностьСерии(СтруктураВыбора, ШтрихкодУпаковки)
	
	Если Не СтруктураВыбора.ОсобенностьУчета = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
		Возврат;
	КонецЕсли;
	
	Серия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШтрихкодУпаковки, "Серия");
	Если ЗначениеЗаполнено(Серия) Тогда
		СтруктураВыбора.Серия = Серия;
	Иначе
		
		Серия = ОбщегоНазначенияРМКУНФ.НайтиСоздатьСериюПоДаннымШтрихкода(СтруктураВыбора.Номенклатура,
			СтруктураВыбора.Штрихкод);
		
		ШтрихкодУпаковкиОбъект = ШтрихкодУпаковки.ПолучитьОбъект();
		ШтрихкодУпаковкиОбъект.Серия = Серия;
		ШтрихкодУпаковкиОбъект.Записать();
		СтруктураВыбора.Серия = Серия;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
